#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_linux_web_app.app_backend_li: Still reading... [10s elapsed]
data.azurerm_linux_web_app.app_backend_li: Still reading... [20s elapsed]
module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_profile_async_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]
module.function_profile_async_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.function_lollipop.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/info"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          + "WEBSITE_WARMUP_PATH"                                                                              = "/info"
            # (28 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02"
        name                                           = "io-p-itn-auth-lollipop-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
                # (3 unchanged elements hidden)
                "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
                "AzureWebJobs.HandlePubKeyRevoke.Disabled",
                # (3 unchanged elements hidden)
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_lollipop.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/info"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          + "WEBSITE_WARMUP_PATH"                                                                              = "/info"
            # (29 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_lv.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/info"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          + "WEBSITE_WARMUP_PATH"                                                                              = "/info"
            # (24 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02"
        name                                           = "io-p-itn-auth-lv-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
                # (6 unchanged elements hidden)
                "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_lv.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/info"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          + "WEBSITE_WARMUP_PATH"                                                                              = "/info"
            # (24 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_profile_async.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/info"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          + "WEBSITE_WARMUP_PATH"                                                                              = "/info"
            # (38 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02"
        name                                           = "io-p-itn-auth-profas-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
                # (6 unchanged elements hidden)
                "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
                "AzureWebJobs.ExpiredSessionAdvisor.Disabled",
                # (3 unchanged elements hidden)
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_profile_async.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/info"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          + "WEBSITE_WARMUP_PATH"                                                                              = "/info"
            # (39 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_profile_autoscale.data.azurerm_linux_function_app.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_linux_function_app" "this" {
      + app_settings                                   = (known after apply)
      + auth_settings                                  = (known after apply)
      + auth_settings_v2                               = (known after apply)
      + availability                                   = (known after apply)
      + backup                                         = (known after apply)
      + builtin_logging_enabled                        = (known after apply)
      + client_certificate_enabled                     = (known after apply)
      + client_certificate_exclusion_paths             = (known after apply)
      + client_certificate_mode                        = (known after apply)
      + connection_string                              = (known after apply)
      + content_share_force_disabled                   = (known after apply)
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = (known after apply)
      + default_hostname                               = (known after apply)
      + enabled                                        = (known after apply)
      + ftp_publish_basic_authentication_enabled       = (known after apply)
      + functions_extension_version                    = (known after apply)
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = (known after apply)
      + id                                             = (known after apply)
      + identity                                       = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = (known after apply)
      + name                                           = "io-p-itn-auth-profile-func-02"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = (known after apply)
      + resource_group_name                            = "io-p-itn-auth-main-rg-01"
      + service_plan_id                                = (known after apply)
      + site_config                                    = (known after apply)
      + site_credential                                = (sensitive value)
      + sticky_settings                                = (known after apply)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = (known after apply)
      + storage_key_vault_secret_id                    = (known after apply)
      + storage_uses_managed_identity                  = (known after apply)
      + tags                                           = (known after apply)
      + usage                                          = (known after apply)
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = (known after apply)
    }

  # module.function_profile_autoscale.azurerm_monitor_autoscale_setting.this must be replaced
-/+ resource "azurerm_monitor_autoscale_setting" "this" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-auth-profile-as-02" -> (known after apply)
      ~ location            = "italynorth" -> (known after apply) # forces replacement
        name                = "io-p-itn-auth-profile-as-02"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      ~ target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-profile-asp-02" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

      ~ profile {
            name = "evening"

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profile-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profile-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-profile-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-profile-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
      ~ profile {
            name = jsonencode(
                {
                    for  = "evening"
                    name = "default"
                }
            )

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profile-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profile-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-profile-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-profile-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.function_public.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/info"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          + "WEBSITE_WARMUP_PATH"                                                                              = "/info"
            # (24 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-public-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-public-func-02"
        name                                           = "io-p-itn-auth-public-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
                # (6 unchanged elements hidden)
                "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_public.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/info"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          + "WEBSITE_WARMUP_PATH"                                                                              = "/info"
            # (25 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-public-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-public-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_web_profile.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/api/v1/info"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          + "WEBSITE_WARMUP_PATH"                                                                              = "/api/v1/info"
            # (38 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01"
        name                                           = "io-p-itn-auth-webprof-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
                # (6 unchanged elements hidden)
                "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_web_profile.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/api/v1/info"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          + "WEBSITE_WARMUP_PATH"                                                                              = "/api/v1/info"
            # (39 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 10 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
